/*题目：企业发放的奖金根据利润提成。

	利润(I)低于或等于10万元时，奖金可提10%；
	利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
	20万到40万之间时，高于20万元的部分，可提成5%；
	40万到60万之间时高于40万元的部分，可提成3%；
	60万到100万之间时，高于60万元的部分，可提成1.5%；
	高于100万元时，超过100万元的部分按1%提成。

从键盘输入当月利润I，求应发放奖金总数？

*/
#include<stdio.h>
main()
{
	float rvenue;
	int o;
	printf("输入利润(单位:万):");
	scanf_s("%f", &rvenue);
	o = rvenue / 10;
	switch (o)
	{
	case 0:
	{
		printf("奖金为:%f万元", rvenue / 10);
		break;
	}
	case 1:
	{
		printf("奖金为:%f万元", 10 * 0.1 + (rvenue - 10.0) * 0.075);
		break;
	}
	case 2:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + (rvenue - 20.0) * 0.05);
		break;
	}
	case 3:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + (rvenue - 20.0) * 0.05);
		break;
	}
	case 4:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (rvenue - 40.0) * 0.03);
		break;
	}
	case 5:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (rvenue - 40.0) * 0.03);
		break;
	}
	case 6:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (rvenue - 60.0) * 0.015);
		break;
	}
	case 7:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (rvenue - 60.0) * 0.015);
		break;
	}
	case 8:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (rvenue - 60.0) * 0.015);
		break;
	}
	case 9:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (rvenue - 60.0) * 0.015);
		break;
	}
	default:
	{
		printf("奖金为:%f万元", 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + 40 * 0.015 + (rvenue - 100.0) * 0.01);
		break;
	}
	}
	printf("\n偷偷告诉你:\"大头全被资本家拿走啦~~~\"");
}